#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры 

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Анкета о доставке
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АнкетаОДоставке";
	КомандаПечати.Представление = НСтр("ru = 'Анкета о доставке'");
	КомандаПечати.Порядок = 5;
	
	// Транспортная накладная
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТранспортнаяНакладная";
	КомандаПечати.Представление = НСтр("ru = 'Транспортная накладная'");
	КомандаПечати.Порядок = 10;
	
		
	// Комплект документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АнкетаОДоставке,ТранспортнаяНакладная";
	КомандаПечати.Представление = НСтр("ru = 'Комплект документов'");
	КомандаПечати.Порядок = 15;     
	
	// Комплект документов
	КомандаПечати = КомандыПечати.Добавить(); 
	КомандаПечати.МенеджерПечати = "УправлениеПечатью";
	КомандаПечати.Идентификатор = "Документ.ДЗ_Доставка.ПФ_DOC_Договор";
	КомандаПечати.Представление = НСтр("ru = 'Договор(docx)'");
	КомандаПечати.Порядок = 20;

	
КонецПроцедуры 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АнкетаОДоставке");   

	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьАнкетаОДоставке(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Анкета о доставке'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ДЗ_Доставка.ПФ_МХL_АнкетаОДоставке";
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ТранспортнаяНакладная");
	
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьТранспортнаяНакладная(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Транспортная накладная'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ДЗ_Доставка.ПФ_МХL_ТранспортнаяНакладная";
	КонецЕсли;
	
	КонецПроцедуры  



Функция ПечатьАнкетаОДоставке(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ДЗ_Доставка.ПФ_МХL_АнкетаОДоставке");
	
    ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Запрос = Новый Запрос ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДЗ_Доставка.Ссылка КАК Ссылка,
	               |	ДЗ_Доставка.Номер КАК Номер,
	               |	ДЗ_Доставка.Дата КАК Дата
	               |ИЗ
	               |	Документ.ДЗ_Доставка КАК ДЗ_Доставка
	               |ГДЕ
	               |	ДЗ_Доставка.Ссылка В(&МассивОбъектов)"; 
	
	Запрос.УстановитьПараметр("МассивОбъектов",МассивОбъектов); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;

	Пока   Выборка.Следующий() Цикл 
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
		ПараметрыОбласти = Новый Структура;
		ПараметрыОбласти.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=DD"));
		ПараметрыОбласти.Вставить("Номер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер));
		
		ОбластьШапка.Параметры.Заполнить(ПараметрыОбласти);
		
		ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода("СсылкаНаДокумент", 1, 120); 
		
		//Картинка = Новый Картинка(ДанныеQRКода);  

		Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось сформировать QR-код.
			|Технические подробности см. в журнале регистрации.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Иначе
			КартинкаQRКода = Новый Картинка(ДанныеQRКода);
			ОбластьШапка.Рисунки.АнкетаОДоставке.Картинка = КартинкаQRКода;
        КонецЕсли;
			
		
		ТабличныйДокумент.Вывести(ОбластьШапка); 
		
		 // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		 НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);	
	КонецЦикла; 
	
	Возврат ТабличныйДокумент;

	
КонецФункции 

Функция ПечатьТранспортнаяНакладная(МассивОбъектов, ОбъектыПечати);

	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ДЗ_Доставка.ПФ_МХL_ТранспортнаяНакладная");
	
    ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
    ОбластьПодвал= Макет.ПолучитьОбласть("Подвал");

	Запрос = Новый Запрос ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДЗ_Доставка.Ссылка КАК Ссылка,
	               |	ДЗ_Доставка.Номер КАК Номер,
	               |	ДЗ_Доставка.Дата КАК Дата,
	               |	ДЗ_Доставка.Товары.(
	               |		НомерСтроки КАК Номер,
	               |		ДЗ_Номенклатура КАК Товар,
	               |		ДЗ_Количество КАК Количество
	               |	) КАК Товары,
	               |	ДЗ_Доставка.ДЗ_Организация КАК Грузоотправитель,
	               |	ДЗ_Доставка.ДЗ_Контрагент КАК Грузополучатель
	               |ИЗ
	               |	Документ.ДЗ_Доставка КАК ДЗ_Доставка
	               |ГДЕ
	               |	ДЗ_Доставка.Ссылка В(&МассивОбъектов)"; 
	
	Запрос.УстановитьПараметр("МассивОбъектов",МассивОбъектов); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;

	Пока   Выборка.Следующий() Цикл 
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
		ПараметрыОбласти = Новый Структура;
		ПараметрыОбласти.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=DD"));
		ПараметрыОбласти.Вставить("Номер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер));  
		ПараметрыОбласти.Вставить("Грузоотправитель", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Грузоотправитель));
		ПараметрыОбласти.Вставить("Грузополучатель", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Грузополучатель));
		ОбластьШапка.Параметры.Заполнить(ПараметрыОбласти);
		
		ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода("СсылкаНаДокумент", 1, 120); 
		
		//Картинка = Новый Картинка(ДанныеQRКода);  

		Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось сформировать QR-код.
			|Технические подробности см. в журнале регистрации.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Иначе
			КартинкаQRКода = Новый Картинка(ДанныеQRКода);
			ОбластьШапка.Рисунки.ТранспорнаяНакладная.Картинка = КартинкаQRКода;
        КонецЕсли;
			
		
		ТабличныйДокумент.Вывести(ОбластьШапка);  
		
		ВыборкаСтроки = Выборка.Товары.Выбрать();
		
		Пока ВыборкаСтроки.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);  
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал); 

		
		 // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		 НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);	
	КонецЦикла; 
	
	Возврат ТабличныйДокумент;

	
КонецФункции



#КонецОбласти   
#КонецЕсли

