#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)  
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		// Заполнение шапки  
		ДЗ_Договор = ДанныеЗаполнения.Договор;
		ДЗ_Комментарий = ДанныеЗаполнения.Комментарий;
		ДЗ_Контрагент = ДанныеЗаполнения.Контрагент;
		ДЗ_Организация = ДанныеЗаполнения.Организация;
		ДЗ_Основание =ДанныеЗаполнения;
	
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ДЗ_Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.ДЗ_Номенклатура = ТекСтрокаТовары.Номенклатура;
		КонецЦикла;
	КонецЕсли;
	
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ 
	
	
КонецПроцедуры
#КонецОбласти